Tutorials/1D/Test7/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue T 1.196421
    volScalarFieldValue p 3.154
    volVectorFieldValue U ( 2.265 0 0 )
);

regions
(
    boxToCell
    {
        box ( -1 -1 -1 ) ( 0.5 1  1 );
        fieldValues
        (
            volScalarFieldValue T 15519.623
            volScalarFieldValue p 782.929
            volVectorFieldValue U (8.905 0 0)
        );
    }
);


// ************************************************************************* //
